
/* Когда надо применять паттерн:
 * Когда заранее неизвестно, объекты каких типов необходимо создавать
 * Когда система должна быть независимой от процесса создания новых объектов и расширяемой:
   в нее можно легко вводить новые классы, объекты которых система должна создавать.
 * Когда создание новых объектов необходимо делегировать из базового класса классам наследникам
 */
namespace Patterns.Creational;

/// <summary> Фабричный метод (Factory Method) </summary>
internal class FactoryMethod {}






